; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	image1 - mode
	spectrograph0 - mode
	thermograph2 - mode
	infrared3 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation0 - direction
	Star3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Planet17 - direction
	Planet18 - direction
	Planet19 - direction
	Planet20 - direction
	Planet21 - direction
	Planet22 - direction
	Planet23 - direction
	Planet24 - direction
	Phenomenon25 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument5 image1)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star2)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared3)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet16)
	(supports instrument7 infrared3)
	(supports instrument7 image1)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 thermograph2)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
	(supports instrument10 infrared3)
	(calibration_target instrument10 GroundStation0)
	(supports instrument11 spectrograph0)
	(supports instrument11 image1)
	(supports instrument11 infrared3)
	(calibration_target instrument11 Star2)
	(supports instrument12 infrared3)
	(supports instrument12 thermograph2)
	(supports instrument12 spectrograph0)
	(calibration_target instrument12 GroundStation0)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite1 Planet23)
	(pointing satellite2 Planet15)
	(have_image Star3 spectrograph0)
	(have_image Phenomenon4 image1)
	(have_image Star5 infrared3)
	(have_image Star6 infrared3)
	(have_image Star7 thermograph2)
	(have_image Star10 image1)
	(have_image Planet11 infrared3)
	(have_image Planet12 infrared3)
	(have_image Phenomenon13 spectrograph0)
	(have_image Planet14 infrared3)
	(have_image Planet15 thermograph2)
	(have_image Planet16 spectrograph0)
	(have_image Planet17 infrared3)
	(have_image Planet18 thermograph2)
	(have_image Planet19 spectrograph0)
	(have_image Planet20 infrared3)
	(have_image Planet21 spectrograph0)
	(have_image Planet22 thermograph2)
	(have_image Planet23 thermograph2)
	(have_image Planet24 infrared3)
	(have_image Phenomenon25 image1)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 23
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 23
3. (calibrate satellite3 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 0 of 23
4. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 23
5. (turn_to satellite3 phenomenon25 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 phenomenon25)
   goals met: 0 of 23
6. (take_image satellite3 phenomenon25 instrument7 image1)
   added: (have_image phenomenon25 image1)
   goals met: 1 of 23
7. (turn_to satellite3 phenomenon4 phenomenon25)
   deleted: (pointing satellite3 phenomenon25)
   added: (pointing satellite3 phenomenon4)
   goals met: 1 of 23
8. (take_image satellite3 phenomenon4 instrument7 image1)
   added: (have_image phenomenon4 image1)
   goals met: 2 of 23
9. (turn_to satellite3 planet11 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 planet11)
   goals met: 2 of 23
10. (take_image satellite3 planet11 instrument7 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 3 of 23
11. (turn_to satellite3 planet12 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet12)
   goals met: 3 of 23
12. (take_image satellite3 planet12 instrument7 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 4 of 23
13. (turn_to satellite3 planet14 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet14)
   goals met: 4 of 23
14. (take_image satellite3 planet14 instrument7 infrared3)
   added: (have_image planet14 infrared3)
   goals met: 5 of 23
15. (turn_to satellite3 planet15 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet15)
   goals met: 5 of 23
16. (take_image satellite3 planet15 instrument7 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 6 of 23
17. (turn_to satellite3 planet17 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 planet17)
   goals met: 6 of 23
18. (take_image satellite3 planet17 instrument7 infrared3)
   added: (have_image planet17 infrared3)
   goals met: 7 of 23
19. (turn_to satellite3 planet18 planet17)
   deleted: (pointing satellite3 planet17)
   added: (pointing satellite3 planet18)
   goals met: 7 of 23
20. (take_image satellite3 planet18 instrument7 thermograph2)
   added: (have_image planet18 thermograph2)
   goals met: 8 of 23
21. (turn_to satellite3 planet20 planet18)
   deleted: (pointing satellite3 planet18)
   added: (pointing satellite3 planet20)
   goals met: 8 of 23
22. (take_image satellite3 planet20 instrument7 infrared3)
   added: (have_image planet20 infrared3)
   goals met: 9 of 23
23. (turn_to satellite3 planet22 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 planet22)
   goals met: 9 of 23
24. (take_image satellite3 planet22 instrument7 thermograph2)
   added: (have_image planet22 thermograph2)
   goals met: 10 of 23
25. (turn_to satellite3 planet23 planet22)
   deleted: (pointing satellite3 planet22)
   added: (pointing satellite3 planet23)
   goals met: 10 of 23
26. (take_image satellite3 planet23 instrument7 thermograph2)
   added: (have_image planet23 thermograph2)
   goals met: 11 of 23
27. (turn_to satellite3 planet24 planet23)
   deleted: (pointing satellite3 planet23)
   added: (pointing satellite3 planet24)
   goals met: 11 of 23
28. (take_image satellite3 planet24 instrument7 infrared3)
   added: (have_image planet24 infrared3)
   goals met: 12 of 23
29. (turn_to satellite3 star10 planet24)
   deleted: (pointing satellite3 planet24)
   added: (pointing satellite3 star10)
   goals met: 12 of 23
30. (take_image satellite3 star10 instrument7 image1)
   added: (have_image star10 image1)
   goals met: 13 of 23
31. (turn_to satellite3 star5 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star5)
   goals met: 13 of 23
32. (take_image satellite3 star5 instrument7 infrared3)
   added: (have_image star5 infrared3)
   goals met: 14 of 23
33. (turn_to satellite3 star6 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star6)
   goals met: 14 of 23
34. (take_image satellite3 star6 instrument7 infrared3)
   added: (have_image star6 infrared3)
   goals met: 15 of 23
35. (turn_to satellite3 star7 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star7)
   goals met: 15 of 23
36. (take_image satellite3 star7 instrument7 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 16 of 23
37. (turn_to satellite2 star2 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 star2)
   goals met: 16 of 23
38. (calibrate satellite2 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 16 of 23
39. (turn_to satellite2 phenomenon13 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon13)
   goals met: 16 of 23
40. (take_image satellite2 phenomenon13 instrument6 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 17 of 23
41. (turn_to satellite2 planet15 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet15)
   goals met: 18 of 23
42. (turn_to satellite1 planet23 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet23)
   goals met: 19 of 23
43. (turn_to satellite2 planet16 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet16)
   goals met: 18 of 23
44. (take_image satellite2 planet16 instrument6 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 19 of 23
45. (turn_to satellite2 planet15 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 planet15)
   goals met: 20 of 23
46. (turn_to satellite2 planet19 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet19)
   goals met: 19 of 23
47. (take_image satellite2 planet19 instrument6 spectrograph0)
   added: (have_image planet19 spectrograph0)
   goals met: 20 of 23
48. (turn_to satellite2 planet15 planet19)
   deleted: (pointing satellite2 planet19)
   added: (pointing satellite2 planet15)
   goals met: 21 of 23
49. (turn_to satellite2 planet21 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet21)
   goals met: 20 of 23
50. (take_image satellite2 planet21 instrument6 spectrograph0)
   added: (have_image planet21 spectrograph0)
   goals met: 21 of 23
51. (turn_to satellite2 planet15 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 planet15)
   goals met: 22 of 23
52. (turn_to satellite2 star3 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 star3)
   goals met: 21 of 23
53. (take_image satellite2 star3 instrument6 spectrograph0)
   added: (have_image star3 spectrograph0)
   goals met: 22 of 23
54. (turn_to satellite2 planet15 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet15)
   goals met: 23 of 23
